spec/fixtures/items_acknowledge_wire.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"2ecc6832-488a-4475-af55-f092d7b391be","first_name":"myFirstName","email":"2ecc6832-488a-4475-af55-f092d7b391be@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:39 GMT
      Etag:
      - W/"599126928ffa0412d2baf331c270c6ca"
      Location:
      - "/users/2ecc6832-488a-4475-af55-f092d7b391be"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ff545e05-1207-4bcc-ac12-7297bef77aa9
      X-Runtime:
      - '1.815415'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:51:39.174Z","updated_at":"2016-05-29T18:51:39.174Z","full_name":"myFirstName","email":"2ecc6832-488a-4475-af55-f092d7b391be@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"2ecc6832-488a-4475-af55-f092d7b391be","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"3ea0f2fd-71cc-422c-81c0-7cb05107afe7"},"links":{"self":"/users","items":"/users/2ecc6832-488a-4475-af55-f092d7b391be/items","card_accounts":"/users/2ecc6832-488a-4475-af55-f092d7b391be/card_accounts","paypal_accounts":"/users/2ecc6832-488a-4475-af55-f092d7b391be/paypal_accounts","bank_accounts":"/users/2ecc6832-488a-4475-af55-f092d7b391be/bank_accounts","wallet_accounts":"/users/2ecc6832-488a-4475-af55-f092d7b391be/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:39 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"306dba53-51e4-483e-bf96-d7df763f96b1","first_name":"myFirstName","email":"306dba53-51e4-483e-bf96-d7df763f96b1@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:41 GMT
      Etag:
      - W/"4e618845a5c4d3bcee820f5c8510cb85"
      Location:
      - "/users/306dba53-51e4-483e-bf96-d7df763f96b1"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 5bf422f5-a23f-4a1f-848c-4fd16282c61b
      X-Runtime:
      - '0.777231'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:51:41.124Z","updated_at":"2016-05-29T18:51:41.124Z","full_name":"myFirstName","email":"306dba53-51e4-483e-bf96-d7df763f96b1@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"306dba53-51e4-483e-bf96-d7df763f96b1","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"8320e88c-4a78-4eb4-b463-51e34bdbd5c4"},"links":{"self":"/users","items":"/users/306dba53-51e4-483e-bf96-d7df763f96b1/items","card_accounts":"/users/306dba53-51e4-483e-bf96-d7df763f96b1/card_accounts","paypal_accounts":"/users/306dba53-51e4-483e-bf96-d7df763f96b1/paypal_accounts","bank_accounts":"/users/306dba53-51e4-483e-bf96-d7df763f96b1/bank_accounts","wallet_accounts":"/users/306dba53-51e4-483e-bf96-d7df763f96b1/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:41 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad","name":"itemName","amount":500,"payment_type":1,"seller_id":"2ecc6832-488a-4475-af55-f092d7b391be","buyer_id":"306dba53-51e4-483e-bf96-d7df763f96b1"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:44 GMT
      Etag:
      - W/"8701ae88314ccf559dabaa0088a652be"
      Location:
      - "/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - d7a7927e-5a89-480f-89c8-3420c1cde8ad
      X-Runtime:
      - '2.849723'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad","name":"itemName","description":null,"created_at":"2016-05-29T18:51:43.071Z","updated_at":"2016-05-29T18:51:43.071Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266383","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"306dba53-51e4-483e-bf96-d7df763f96b1@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"2ecc6832-488a-4475-af55-f092d7b391be@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"306dba53-51e4-483e-bf96-d7df763f96b1","sellers":"2ecc6832-488a-4475-af55-f092d7b391be"},"links":{"self":"/items","buyers":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/buyers","sellers":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/sellers","status":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/status","fees":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/fees","transactions":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/transactions","wire_details":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/wire_details","bpay_details":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:45 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/acknowledge_wire
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:46 GMT
      Etag:
      - W/"b7b96884cd5a6c69f12edc03bb0692c6"
      Location:
      - "/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - b62f8749-c758-4b0e-9cf5-e948ffbbac03
      X-Runtime:
      - '0.860044'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad","name":"itemName","description":null,"created_at":"2016-05-29T18:51:43.071Z","updated_at":"2016-05-29T18:51:46.144Z","state":"wire_pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22110,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266383","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"306dba53-51e4-483e-bf96-d7df763f96b1@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"2ecc6832-488a-4475-af55-f092d7b391be@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"306dba53-51e4-483e-bf96-d7df763f96b1","sellers":"2ecc6832-488a-4475-af55-f092d7b391be"},"links":{"self":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/acknowledge_wire","buyers":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/buyers","sellers":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/sellers","status":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/status","fees":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/fees","transactions":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/transactions","wire_details":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/wire_details","bpay_details":"/items/0c0869b7-f7ad-4ff1-bb3a-291a7bff0dad/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:46 GMT
recorded_with: VCR 2.9.3
