spec/fixtures/items_batch_transactions.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"a649408b-7d93-4e0e-94b8-592efc375a2e","first_name":"myFirstName","email":"a649408b-7d93-4e0e-94b8-592efc375a2e@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:17 GMT
      Etag:
      - W/"ae1fff028252f55e55ad6c81520b79f5"
      Location:
      - "/users/a649408b-7d93-4e0e-94b8-592efc375a2e"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - d69f51c0-22f0-44a2-b0ba-73be307f3959
      X-Runtime:
      - '1.166764'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-08-28T12:42:16.924Z","updated_at":"2016-08-28T12:42:16.924Z","full_name":"myFirstName","email":"a649408b-7d93-4e0e-94b8-592efc375a2e@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"a649408b-7d93-4e0e-94b8-592efc375a2e","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"bdf00e4b-425c-4bbc-b4c8-fc45e27c2643"},"links":{"self":"/users","items":"/users/a649408b-7d93-4e0e-94b8-592efc375a2e/items","card_accounts":"/users/a649408b-7d93-4e0e-94b8-592efc375a2e/card_accounts","paypal_accounts":"/users/a649408b-7d93-4e0e-94b8-592efc375a2e/paypal_accounts","bank_accounts":"/users/a649408b-7d93-4e0e-94b8-592efc375a2e/bank_accounts","wallet_accounts":"/users/a649408b-7d93-4e0e-94b8-592efc375a2e/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:17 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"a649408b-7d93-4e0e-94b8-592efc375a2e","bank_name":"myBank","account_name":"myAccount","routing_number":"123123","account_number":"12341234","account_type":"savings","holder_type":"personal","country":"AUS","mobile_pin":"123456"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:18 GMT
      Etag:
      - W/"a8306e3a868f8444f874751b69885445"
      Location:
      - "/bank_accounts/20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 016c00ce-50c1-4a94-a62c-0894b7b78d69
      X-Runtime:
      - '0.648172'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '488'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"bank_accounts":{"active":true,"created_at":"2016-08-28T12:42:18.569Z","updated_at":"2016-08-28T12:42:18.569Z","id":"20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a","currency":"AUD","bank":{"bank_name":"myBank","country":"AUS","account_name":"myAccount","routing_number":"XXXXX3","account_number":"XXX234","holder_type":"personal","account_type":"savings"},"links":{"self":"/bank_accounts/20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a","users":"/bank_accounts/20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a/users"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:18 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/direct_debit_authorities
    body:
      encoding: UTF-8
      string: '{"account_id":"20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a","amount":100000}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:19 GMT
      Etag:
      - W/"2b4282aa4eb179d6465b2610321370eb"
      Location:
      - "/direct_debit_authorities/669cca80-a412-428c-bf59-da1e76dc1250"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 36a8b28d-a94f-4a00-9f51-92d667dc70d8
      X-Runtime:
      - '0.413626'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '383'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"direct_debit_authorities":{"id":"669cca80-a412-428c-bf59-da1e76dc1250","created_at":"2016-08-28T12:42:19.802Z","updated_at":"2016-08-28T12:42:19.802Z","amount":100000,"bank_bsb":"083001","debit_user_id":"481561","state":"approved","related":{"bank_accounts":"20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a"},"links":{"self":"/direct_debit_authorities/669cca80-a412-428c-bf59-da1e76dc1250"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:20 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"997034de-3708-4e57-ab7e-850a0d3b471c","first_name":"myFirstName","email":"997034de-3708-4e57-ab7e-850a0d3b471c@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:21 GMT
      Etag:
      - W/"f81f988cac6350fa0019cfb7e9955bcc"
      Location:
      - "/users/997034de-3708-4e57-ab7e-850a0d3b471c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 38960573-309e-44ee-addc-6a891040a949
      X-Runtime:
      - '1.181367'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-08-28T12:42:21.226Z","updated_at":"2016-08-28T12:42:21.226Z","full_name":"myFirstName","email":"997034de-3708-4e57-ab7e-850a0d3b471c@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"997034de-3708-4e57-ab7e-850a0d3b471c","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"cf5b3204-cce0-4ca2-9040-5c90bdfd237f"},"links":{"self":"/users","items":"/users/997034de-3708-4e57-ab7e-850a0d3b471c/items","card_accounts":"/users/997034de-3708-4e57-ab7e-850a0d3b471c/card_accounts","paypal_accounts":"/users/997034de-3708-4e57-ab7e-850a0d3b471c/paypal_accounts","bank_accounts":"/users/997034de-3708-4e57-ab7e-850a0d3b471c/bank_accounts","wallet_accounts":"/users/997034de-3708-4e57-ab7e-850a0d3b471c/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:21 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c","name":"itemName","amount":500,"payment_type":1,"seller_id":"997034de-3708-4e57-ab7e-850a0d3b471c","buyer_id":"a649408b-7d93-4e0e-94b8-592efc375a2e"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:24 GMT
      Etag:
      - W/"df288cd79cab26cc00af29302b3af373"
      Location:
      - "/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 9cb282ea-d915-4a88-83f5-d8d050d15074
      X-Runtime:
      - '1.628265'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '1499'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c","name":"itemName","description":null,"created_at":"2016-08-28T12:42:23.130Z","updated_at":"2016-08-28T12:42:23.130Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015517044","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"a649408b-7d93-4e0e-94b8-592efc375a2e@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"997034de-3708-4e57-ab7e-850a0d3b471c@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a649408b-7d93-4e0e-94b8-592efc375a2e","sellers":"997034de-3708-4e57-ab7e-850a0d3b471c"},"links":{"self":"/items","buyers":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/buyers","sellers":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/sellers","status":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/status","fees":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/fees","transactions":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/transactions","wire_details":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/wire_details","bpay_details":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:24 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/request_payment
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:25 GMT
      Etag:
      - W/"559c39b830d7230808e865bc8d2ad5e1"
      Location:
      - "/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 427192b3-8261-4497-95e2-91af75904a76
      X-Runtime:
      - '1.017099'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c","name":"itemName","description":null,"created_at":"2016-08-28T12:42:23.130Z","updated_at":"2016-08-28T12:42:25.058Z","state":"payment_required","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22100,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015517044","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"a649408b-7d93-4e0e-94b8-592efc375a2e@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"997034de-3708-4e57-ab7e-850a0d3b471c@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a649408b-7d93-4e0e-94b8-592efc375a2e","sellers":"997034de-3708-4e57-ab7e-850a0d3b471c"},"links":{"self":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/request_payment","buyers":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/buyers","sellers":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/sellers","status":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/status","fees":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/fees","transactions":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/transactions","wire_details":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/wire_details","bpay_details":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:25 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/make_payment
    body:
      encoding: UTF-8
      string: '{"account_id":"20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:28 GMT
      Etag:
      - W/"6ed7f316061e5b0e816a9f3c30207369"
      Location:
      - "/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - f6447d08-8b93-4c47-b806-a73ddef89b54
      X-Runtime:
      - '1.636893'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c","name":"itemName","description":null,"created_at":"2016-08-28T12:42:23.130Z","updated_at":"2016-08-28T12:42:27.411Z","state":"payment_pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22150,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015517044","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"a649408b-7d93-4e0e-94b8-592efc375a2e@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"997034de-3708-4e57-ab7e-850a0d3b471c@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a649408b-7d93-4e0e-94b8-592efc375a2e","sellers":"997034de-3708-4e57-ab7e-850a0d3b471c"},"links":{"self":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/make_payment","buyers":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/buyers","sellers":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/sellers","status":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/status","fees":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/fees","transactions":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/transactions","wire_details":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/wire_details","bpay_details":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:28 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/batch_transactions
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 28 Aug 2016 12:42:29 GMT
      Etag:
      - W/"8c2f2dcc98f1ce958c3e2aa8546031ac"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ac6df5d9-62df-4470-b563-0bc3e0aed812
      X-Runtime:
      - '0.844850'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"batch_transactions":[{"id":"1412fbef-a43e-441a-b290-8cb2646a0da5","created_at":"2016-08-28T12:42:27.392Z","updated_at":"2016-08-28T12:42:27.392Z","status":12100,"type":"payment","type_method":"direct_debit","batch_id":null,"reference":null,"state":"pending","user_id":"a649408b-7d93-4e0e-94b8-592efc375a2e","account_id":"20d3e66e-4c0e-4dcb-97c4-4544ac54fd8a","from_user_name":"myFirstName","from_user_id":"a649408b-7d93-4e0e-94b8-592efc375a2e","account_type":"bank_account","amount":500,"currency":"AUD","debit_credit":"debit","description":"Debit
        of $5.00 from Bank Account for Credit of $5.00 to Item","related":{"account_to":{"id":"3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c","account_type":"item","user_id":"3faa11a7c4b663881f04c35b75b46e2c"}}}],"meta":{"limit":10,"offset":0,"total":1},"links":{"self":"/items/3bd9a0f9-95e4-428a-b6e5-c39a0af8ff7c/batch_transactions"}}'
    http_version: 
  recorded_at: Sun, 28 Aug 2016 12:42:29 GMT
recorded_with: VCR 3.0.3
