spec/fixtures/items_cancel.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"72b10a8d-d12e-450f-8de3-1801815fa7b3","first_name":"myFirstName","email":"72b10a8d-d12e-450f-8de3-1801815fa7b3@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:29:59 GMT
      Etag:
      - W/"56fa83212b841a050be5e9bf3a3f5707"
      Location:
      - "/users/72b10a8d-d12e-450f-8de3-1801815fa7b3"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - f3741ec0-e694-447b-8890-d34234339b4e
      X-Runtime:
      - '0.724206'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:29:59.483Z","updated_at":"2016-05-29T18:29:59.483Z","full_name":"myFirstName","email":"72b10a8d-d12e-450f-8de3-1801815fa7b3@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"72b10a8d-d12e-450f-8de3-1801815fa7b3","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"46b6f1c1-15e0-4bf6-a4a8-2efe2b1e62b8"},"links":{"self":"/users","items":"/users/72b10a8d-d12e-450f-8de3-1801815fa7b3/items","card_accounts":"/users/72b10a8d-d12e-450f-8de3-1801815fa7b3/card_accounts","paypal_accounts":"/users/72b10a8d-d12e-450f-8de3-1801815fa7b3/paypal_accounts","bank_accounts":"/users/72b10a8d-d12e-450f-8de3-1801815fa7b3/bank_accounts","wallet_accounts":"/users/72b10a8d-d12e-450f-8de3-1801815fa7b3/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:29:59 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5","first_name":"myFirstName","email":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:30:01 GMT
      Etag:
      - W/"4395a6213cb05a8d359ff95afc7f0e83"
      Location:
      - "/users/1ce647cf-9626-4d6a-91ce-98d0087ef1b5"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 03f6259f-a7f4-4f7f-a07e-45042b30e56c
      X-Runtime:
      - '0.818168'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:30:01.057Z","updated_at":"2016-05-29T18:30:01.057Z","full_name":"myFirstName","email":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"531a7147-f89c-4c2b-8347-0f2d5fc1a30e"},"links":{"self":"/users","items":"/users/1ce647cf-9626-4d6a-91ce-98d0087ef1b5/items","card_accounts":"/users/1ce647cf-9626-4d6a-91ce-98d0087ef1b5/card_accounts","paypal_accounts":"/users/1ce647cf-9626-4d6a-91ce-98d0087ef1b5/paypal_accounts","bank_accounts":"/users/1ce647cf-9626-4d6a-91ce-98d0087ef1b5/bank_accounts","wallet_accounts":"/users/1ce647cf-9626-4d6a-91ce-98d0087ef1b5/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:30:01 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"916cf7cf-d1f0-4343-a65b-7799e5ccab0c","name":"itemName","amount":500,"payment_type":1,"seller_id":"72b10a8d-d12e-450f-8de3-1801815fa7b3","buyer_id":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:30:03 GMT
      Etag:
      - W/"07f30522efe0a51b19fa105a7f113a93"
      Location:
      - "/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - e8c1a43c-1ffc-415d-8a75-638d0db489fc
      X-Runtime:
      - '1.207600'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"916cf7cf-d1f0-4343-a65b-7799e5ccab0c","name":"itemName","description":null,"created_at":"2016-05-29T18:30:02.507Z","updated_at":"2016-05-29T18:30:02.507Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266262","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"72b10a8d-d12e-450f-8de3-1801815fa7b3@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5","sellers":"72b10a8d-d12e-450f-8de3-1801815fa7b3"},"links":{"self":"/items","buyers":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/buyers","sellers":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/sellers","status":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/status","fees":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/fees","transactions":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/transactions","wire_details":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/wire_details","bpay_details":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:30:03 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/cancel
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:30:04 GMT
      Etag:
      - W/"afdad56591f6347fa2faa6f73ed90dd3"
      Location:
      - "/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - a74acab1-0e36-4336-9d7d-b1194d2e813b
      X-Runtime:
      - '0.661368'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"916cf7cf-d1f0-4343-a65b-7799e5ccab0c","name":"itemName","description":null,"created_at":"2016-05-29T18:30:02.507Z","updated_at":"2016-05-29T18:30:04.367Z","state":"cancelled","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22575,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266262","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"72b10a8d-d12e-450f-8de3-1801815fa7b3@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5","sellers":"72b10a8d-d12e-450f-8de3-1801815fa7b3"},"links":{"self":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/cancel","buyers":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/buyers","sellers":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/sellers","status":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/status","fees":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/fees","transactions":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/transactions","wire_details":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/wire_details","bpay_details":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:30:04 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:30:06 GMT
      Etag:
      - W/"7c6d5e1e2303d42e0cb723d3a622cda7"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 6b2a3729-89e2-4007-944b-026c7b69a426
      X-Runtime:
      - '0.551729'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '580'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"916cf7cf-d1f0-4343-a65b-7799e5ccab0c","name":"itemName","description":null,"created_at":"2016-05-29T18:30:02.507Z","updated_at":"2016-05-29T18:30:04.367Z","state":"cancelled","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22575,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266262","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"72b10a8d-d12e-450f-8de3-1801815fa7b3@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"1ce647cf-9626-4d6a-91ce-98d0087ef1b5","sellers":"72b10a8d-d12e-450f-8de3-1801815fa7b3"},"links":{"self":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c","buyers":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/buyers","sellers":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/sellers","status":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/status","fees":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/fees","transactions":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/transactions","wire_details":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/wire_details","bpay_details":"/items/916cf7cf-d1f0-4343-a65b-7799e5ccab0c/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:30:06 GMT
recorded_with: VCR 2.9.3
