spec/fixtures/items_decline_refund.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"f61b7fef-c41f-4ea0-acf2-bdff34de8443","first_name":"myFirstName","email":"f61b7fef-c41f-4ea0-acf2-bdff34de8443@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:18 GMT
      Etag:
      - W/"4e408213a0f4a25e3738c44411739b2d"
      Location:
      - "/users/f61b7fef-c41f-4ea0-acf2-bdff34de8443"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 378ae1ba-310c-470d-8ea3-2b5838b6b8e1
      X-Runtime:
      - '0.977530'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-08-15T19:38:18.078Z","updated_at":"2016-08-15T19:38:18.078Z","full_name":"myFirstName","email":"f61b7fef-c41f-4ea0-acf2-bdff34de8443@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"f61b7fef-c41f-4ea0-acf2-bdff34de8443","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"e8ee33c1-536a-4910-b532-31cfdcee91e6"},"links":{"self":"/users","items":"/users/f61b7fef-c41f-4ea0-acf2-bdff34de8443/items","card_accounts":"/users/f61b7fef-c41f-4ea0-acf2-bdff34de8443/card_accounts","paypal_accounts":"/users/f61b7fef-c41f-4ea0-acf2-bdff34de8443/paypal_accounts","bank_accounts":"/users/f61b7fef-c41f-4ea0-acf2-bdff34de8443/bank_accounts","wallet_accounts":"/users/f61b7fef-c41f-4ea0-acf2-bdff34de8443/wallet_accounts"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:18 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"a21a9079-555e-4e19-9624-f9670ab18f16","first_name":"myFirstName","email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:20 GMT
      Etag:
      - W/"4aaef340de04f397b48248b561d8d51b"
      Location:
      - "/users/a21a9079-555e-4e19-9624-f9670ab18f16"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ee8c52bb-7f28-464e-8edc-d514ececc50e
      X-Runtime:
      - '1.037107'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-08-15T19:38:20.010Z","updated_at":"2016-08-15T19:38:20.010Z","full_name":"myFirstName","email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"a21a9079-555e-4e19-9624-f9670ab18f16","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"7ba4763a-c22a-4a7b-8fd5-6c4a19bc9081"},"links":{"self":"/users","items":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/items","card_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/card_accounts","paypal_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/paypal_accounts","bank_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/bank_accounts","wallet_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/wallet_accounts"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:20 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"2d359d52-54fa-4553-8b14-cfc4efb17278","name":"itemName","amount":500,"payment_type":1,"seller_id":"f61b7fef-c41f-4ea0-acf2-bdff34de8443","buyer_id":"a21a9079-555e-4e19-9624-f9670ab18f16"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:22 GMT
      Etag:
      - W/"486877aecf63bef5cdc660c9d3767635"
      Location:
      - "/items/2d359d52-54fa-4553-8b14-cfc4efb17278"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 7c150fd8-3df4-497e-a897-82d0a2971aa6
      X-Runtime:
      - '1.564939'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"2d359d52-54fa-4553-8b14-cfc4efb17278","name":"itemName","description":null,"created_at":"2016-08-15T19:38:21.830Z","updated_at":"2016-08-15T19:38:21.830Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015438404","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"f61b7fef-c41f-4ea0-acf2-bdff34de8443@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a21a9079-555e-4e19-9624-f9670ab18f16","sellers":"f61b7fef-c41f-4ea0-acf2-bdff34de8443"},"links":{"self":"/items","buyers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/buyers","sellers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/sellers","status":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/status","fees":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/fees","transactions":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/transactions","wire_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/wire_details","bpay_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/bpay_details"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:23 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/2d359d52-54fa-4553-8b14-cfc4efb17278/buyers
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:24 GMT
      Etag:
      - W/"2cce9986b97f5ae533770e049901f6fc"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 8ee2b799-01ee-43d1-87f3-81812f954b72
      X-Runtime:
      - '0.874044'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '425'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"users":{"created_at":"2016-08-15T19:38:20.010Z","updated_at":"2016-08-15T19:38:20.010Z","full_name":"myFirstName","email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"a21a9079-555e-4e19-9624-f9670ab18f16","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"7ba4763a-c22a-4a7b-8fd5-6c4a19bc9081"},"links":{"self":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/buyers","items":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/items","card_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/card_accounts","paypal_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/paypal_accounts","bank_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/bank_accounts","wallet_accounts":"/users/a21a9079-555e-4e19-9624-f9670ab18f16/wallet_accounts"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:25 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/card_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"a21a9079-555e-4e19-9624-f9670ab18f16","full_name":"User
        Name","number":"4111111111111111","expiry_month":8,"expiry_year":2017,"cvv":"123"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:27 GMT
      Etag:
      - W/"885382f2dbf2e190e2e0618960b7a608"
      Location:
      - "/card_accounts/19903903-b38a-4ca8-ab5d-bad2e59f3c12"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 98dc8d00-dab6-4e92-a296-d76bc5c8d43f
      X-Runtime:
      - '1.936454'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"card_accounts":{"active":true,"created_at":"2016-08-15T19:38:27.074Z","updated_at":"2016-08-15T19:38:27.074Z","id":"19903903-b38a-4ca8-ab5d-bad2e59f3c12","currency":"AUD","links":{"self":"/card_accounts/19903903-b38a-4ca8-ab5d-bad2e59f3c12","users":"/card_accounts/19903903-b38a-4ca8-ab5d-bad2e59f3c12/users"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:27 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/2d359d52-54fa-4553-8b14-cfc4efb17278/make_payment
    body:
      encoding: UTF-8
      string: '{"user_id":"a21a9079-555e-4e19-9624-f9670ab18f16","account_id":"19903903-b38a-4ca8-ab5d-bad2e59f3c12"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:35 GMT
      Etag:
      - W/"86b79c8aae7b83a84dafa7562ece0e2d"
      Location:
      - "/items/2d359d52-54fa-4553-8b14-cfc4efb17278"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 7c4b5f88-c9e5-4acb-80e8-23c9142ed75c
      X-Runtime:
      - '7.375903'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"2d359d52-54fa-4553-8b14-cfc4efb17278","name":"itemName","description":null,"created_at":"2016-08-15T19:38:21.830Z","updated_at":"2016-08-15T19:38:34.926Z","state":"payment_deposited","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22200,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015438404","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","buyer_name":"myFirstName","buyer_email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"f61b7fef-c41f-4ea0-acf2-bdff34de8443@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a21a9079-555e-4e19-9624-f9670ab18f16","sellers":"f61b7fef-c41f-4ea0-acf2-bdff34de8443"},"links":{"self":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/make_payment","buyers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/buyers","sellers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/sellers","status":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/status","fees":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/fees","transactions":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/transactions","wire_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/wire_details","bpay_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/bpay_details"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:36 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/2d359d52-54fa-4553-8b14-cfc4efb17278/request_refund
    body:
      encoding: UTF-8
      string: '{"refund_amount":500,"refund_message":"because"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:37 GMT
      Etag:
      - W/"ad0536c08639299654fbd6e1dab9f7fd"
      Location:
      - "/items/2d359d52-54fa-4553-8b14-cfc4efb17278"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ce405843-50e4-45b0-997e-daad875d3756
      X-Runtime:
      - '0.773387'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"2d359d52-54fa-4553-8b14-cfc4efb17278","name":"itemName","description":null,"created_at":"2016-08-15T19:38:21.830Z","updated_at":"2016-08-15T19:38:36.935Z","state":"refund_flagged","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22650,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015438404","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","refund_message":"because","refund_amount":500,"buyer_name":"myFirstName","buyer_email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"f61b7fef-c41f-4ea0-acf2-bdff34de8443@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a21a9079-555e-4e19-9624-f9670ab18f16","sellers":"f61b7fef-c41f-4ea0-acf2-bdff34de8443"},"links":{"self":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/request_refund","buyers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/buyers","sellers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/sellers","status":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/status","fees":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/fees","transactions":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/transactions","wire_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/wire_details","bpay_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/bpay_details"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:37 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/2d359d52-54fa-4553-8b14-cfc4efb17278/decline_refund
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Mon, 15 Aug 2016 19:38:38 GMT
      Etag:
      - W/"9794c92dceb482be098e8c25a1d4f69e"
      Location:
      - "/items/2d359d52-54fa-4553-8b14-cfc4efb17278"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - c05bb2b8-0d00-4cf7-97da-c58cff7263d2
      X-Runtime:
      - '0.715864'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"2d359d52-54fa-4553-8b14-cfc4efb17278","name":"itemName","description":null,"created_at":"2016-08-15T19:38:21.830Z","updated_at":"2016-08-15T19:38:38.383Z","state":"payment_deposited","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22200,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014015438404","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","buyer_name":"myFirstName","buyer_email":"a21a9079-555e-4e19-9624-f9670ab18f16@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"f61b7fef-c41f-4ea0-acf2-bdff34de8443@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"a21a9079-555e-4e19-9624-f9670ab18f16","sellers":"f61b7fef-c41f-4ea0-acf2-bdff34de8443"},"links":{"self":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/decline_refund","buyers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/buyers","sellers":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/sellers","status":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/status","fees":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/fees","transactions":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/transactions","wire_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/wire_details","bpay_details":"/items/2d359d52-54fa-4553-8b14-cfc4efb17278/bpay_details"}}}'
    http_version: 
  recorded_at: Mon, 15 Aug 2016 19:38:39 GMT
recorded_with: VCR 3.0.3
