spec/fixtures/items_make_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"256102ad-4337-4092-bfe0-d9b883430913","first_name":"myFirstName","email":"256102ad-4337-4092-bfe0-d9b883430913@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:10:47 GMT
      Etag:
      - W/"afb34b1b5758ec5d9cdfb031493e04e2"
      Location:
      - "/users/256102ad-4337-4092-bfe0-d9b883430913"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 7aa2c27a-1b3e-4966-aa1e-4e24bb9888c5
      X-Runtime:
      - '0.736236'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:10:46.937Z","updated_at":"2016-05-29T21:10:46.937Z","full_name":"myFirstName","email":"256102ad-4337-4092-bfe0-d9b883430913@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"256102ad-4337-4092-bfe0-d9b883430913","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"a93ce40d-b230-4c8a-88c8-dc42bc503353"},"links":{"self":"/users","items":"/users/256102ad-4337-4092-bfe0-d9b883430913/items","card_accounts":"/users/256102ad-4337-4092-bfe0-d9b883430913/card_accounts","paypal_accounts":"/users/256102ad-4337-4092-bfe0-d9b883430913/paypal_accounts","bank_accounts":"/users/256102ad-4337-4092-bfe0-d9b883430913/bank_accounts","wallet_accounts":"/users/256102ad-4337-4092-bfe0-d9b883430913/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:10:47 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"0bed9be1-e105-41cd-b281-c1345cb24532","first_name":"myFirstName","email":"0bed9be1-e105-41cd-b281-c1345cb24532@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:10:48 GMT
      Etag:
      - W/"9aaad14d4dec6509e54b03487c2c576a"
      Location:
      - "/users/0bed9be1-e105-41cd-b281-c1345cb24532"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - db34f226-456b-4539-b7c3-f4b5a012e34b
      X-Runtime:
      - '0.778156'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:10:48.692Z","updated_at":"2016-05-29T21:10:48.692Z","full_name":"myFirstName","email":"0bed9be1-e105-41cd-b281-c1345cb24532@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"0bed9be1-e105-41cd-b281-c1345cb24532","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"0962800a-3f75-4e38-8196-c57a15d052f3"},"links":{"self":"/users","items":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/items","card_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/card_accounts","paypal_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/paypal_accounts","bank_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/bank_accounts","wallet_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:10:49 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"8123cbed-7e24-4b7b-9b57-bf14a59bb6ca","name":"itemName","amount":500,"payment_type":1,"seller_id":"256102ad-4337-4092-bfe0-d9b883430913","buyer_id":"0bed9be1-e105-41cd-b281-c1345cb24532"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:10:51 GMT
      Etag:
      - W/"556f2ad53f14368f86aff7d68f76da72"
      Location:
      - "/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 7e6069c7-11bc-4524-8aea-058d70277f7e
      X-Runtime:
      - '1.644190'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"8123cbed-7e24-4b7b-9b57-bf14a59bb6ca","name":"itemName","description":null,"created_at":"2016-05-29T21:10:50.465Z","updated_at":"2016-05-29T21:10:50.465Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266650","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"0bed9be1-e105-41cd-b281-c1345cb24532@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"256102ad-4337-4092-bfe0-d9b883430913@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"0bed9be1-e105-41cd-b281-c1345cb24532","sellers":"256102ad-4337-4092-bfe0-d9b883430913"},"links":{"self":"/items","buyers":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/buyers","sellers":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/sellers","status":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/status","fees":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/fees","transactions":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/transactions","wire_details":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/wire_details","bpay_details":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:10:51 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/buyers
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:10:53 GMT
      Etag:
      - W/"e1b82f80f4a051538519d02f6d66d473"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 32ff3dbf-ff9f-4ee8-a177-12b9c5cf2f27
      X-Runtime:
      - '0.796459'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"users":{"created_at":"2016-05-29T21:10:48.692Z","updated_at":"2016-05-29T21:10:48.692Z","full_name":"myFirstName","email":"0bed9be1-e105-41cd-b281-c1345cb24532@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"0bed9be1-e105-41cd-b281-c1345cb24532","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"0962800a-3f75-4e38-8196-c57a15d052f3"},"links":{"self":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/buyers","items":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/items","card_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/card_accounts","paypal_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/paypal_accounts","bank_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/bank_accounts","wallet_accounts":"/users/0bed9be1-e105-41cd-b281-c1345cb24532/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:10:53 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/card_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"0bed9be1-e105-41cd-b281-c1345cb24532","full_name":"User
        Name","number":"4111111111111111","expiry_month":5,"expiry_year":2017,"cvv":"123"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:10:55 GMT
      Etag:
      - W/"6d552059298843afc8a6a6f5c3f16277"
      Location:
      - "/card_accounts/b45735ed-5408-4290-977f-98ae98dd550e"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - bc06cc8d-e874-4a8a-811b-7bdcc91ba4cd
      X-Runtime:
      - '1.450697'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"card_accounts":{"active":true,"created_at":"2016-05-29T21:10:55.426Z","updated_at":"2016-05-29T21:10:55.426Z","id":"b45735ed-5408-4290-977f-98ae98dd550e","currency":"AUD","links":{"self":"/card_accounts/b45735ed-5408-4290-977f-98ae98dd550e","users":"/card_accounts/b45735ed-5408-4290-977f-98ae98dd550e/users"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:10:55 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/make_payment
    body:
      encoding: UTF-8
      string: '{"user_id":"0bed9be1-e105-41cd-b281-c1345cb24532","account_id":"b45735ed-5408-4290-977f-98ae98dd550e"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:11:02 GMT
      Etag:
      - W/"dadc2c72ee1d590c1526952155f3b66a"
      Location:
      - "/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - dfaa3634-709d-4ccb-9bdd-0d5a9eab9c6c
      X-Runtime:
      - '6.266050'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"8123cbed-7e24-4b7b-9b57-bf14a59bb6ca","name":"itemName","description":null,"created_at":"2016-05-29T21:10:50.465Z","updated_at":"2016-05-29T21:11:01.906Z","state":"payment_deposited","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22200,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266650","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","buyer_name":"myFirstName","buyer_email":"0bed9be1-e105-41cd-b281-c1345cb24532@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"256102ad-4337-4092-bfe0-d9b883430913@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"0bed9be1-e105-41cd-b281-c1345cb24532","sellers":"256102ad-4337-4092-bfe0-d9b883430913"},"links":{"self":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/make_payment","buyers":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/buyers","sellers":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/sellers","status":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/status","fees":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/fees","transactions":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/transactions","wire_details":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/wire_details","bpay_details":"/items/8123cbed-7e24-4b7b-9b57-bf14a59bb6ca/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:11:02 GMT
recorded_with: VCR 2.9.3
